#lang reader serval/lang/dwarf

target/riscv64gc-unknown-linux-gnu/release/libserval_rust_examples.so:     file format elf64-littleriscv

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xe1 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x0): clang LLVM (rustc version 1.67.0-nightly (a28f3c88e 2022-11-20))
    <10>   DW_AT_language    : 28	(Rust)
    <12>   DW_AT_name        : (indirect string, offset: 0x41): src/lib.rs/@/serval_rust_examples.7801504a-cgu.0
    <16>   DW_AT_stmt_list   : 0x0
    <1a>   DW_AT_comp_dir    : (indirect string, offset: 0x72): /home/filippo/project_artifact/serval_rust_examples
    <1e>   DW_AT_GNU_pubnames: 1
    <1e>   DW_AT_low_pc      : 0x0
    <26>   DW_AT_ranges      : 0x60
 <1><2a>: Abbrev Number: 2 (DW_TAG_namespace)
    <2b>   DW_AT_name        : (indirect string, offset: 0x91): serval_rust_examples
 <2><2f>: Abbrev Number: 2 (DW_TAG_namespace)
    <30>   DW_AT_name        : (indirect string, offset: 0xa6): libarray
 <3><34>: Abbrev Number: 3 (DW_TAG_variable)
    <35>   DW_AT_name        : (indirect string, offset: 0xaf): array_to_sum
    <39>   DW_AT_type        : <0xbb>
    <3d>   DW_AT_external    : 1
    <3d>   DW_AT_decl_file   : 1
    <3e>   DW_AT_decl_line   : 4
    <3f>   DW_AT_alignment   : 4
    <40>   DW_AT_location    : 9 byte block: 3 78 15 0 0 0 0 0 0 	(DW_OP_addr: 1578)
 <3><4a>: Abbrev Number: 3 (DW_TAG_variable)
    <4b>   DW_AT_name        : (indirect string, offset: 0xd0): array_to_sum_2
    <4f>   DW_AT_type        : <0xbb>
    <53>   DW_AT_external    : 1
    <53>   DW_AT_decl_file   : 1
    <54>   DW_AT_decl_line   : 7
    <55>   DW_AT_alignment   : 4
    <56>   DW_AT_location    : 9 byte block: 3 8 30 0 0 0 0 0 0 	(DW_OP_addr: 3008)
 <3><60>: Abbrev Number: 4 (DW_TAG_subprogram)
    <61>   DW_AT_low_pc      : 0x9d8
    <69>   DW_AT_high_pc     : 0x1e
    <6d>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <6f>   DW_AT_name        : (indirect string, offset: 0xdf): init_array
    <73>   DW_AT_decl_file   : 1
    <74>   DW_AT_decl_line   : 11
    <75>   DW_AT_external    : 1
 <3><75>: Abbrev Number: 5 (DW_TAG_subprogram)
    <76>   DW_AT_low_pc      : 0x9f6
    <7e>   DW_AT_high_pc     : 0x5e
    <82>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <84>   DW_AT_name        : (indirect string, offset: 0xea): sum_array
    <88>   DW_AT_decl_file   : 1
    <89>   DW_AT_decl_line   : 37
    <8a>   DW_AT_type        : <0xd6>
    <8e>   DW_AT_external    : 1
 <4><8e>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <8f>   DW_AT_ranges      : 0x0
 <5><93>: Abbrev Number: 7 (DW_TAG_variable)
    <94>   DW_AT_location    : 2 byte block: 91 10 	(DW_OP_fbreg: 16)
    <97>   DW_AT_name        : (indirect string, offset: 0xf4): result
    <9b>   DW_AT_alignment   : 1
    <9c>   DW_AT_decl_file   : 1
    <9d>   DW_AT_decl_line   : 50
    <9e>   DW_AT_type        : <0xd6>
 <5><a2>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <a3>   DW_AT_ranges      : 0x30
 <6><a7>: Abbrev Number: 7 (DW_TAG_variable)
    <a8>   DW_AT_location    : 2 byte block: 91 18 	(DW_OP_fbreg: 24)
    <ab>   DW_AT_name        : (indirect string, offset: 0xae9b): i
    <af>   DW_AT_alignment   : 1
    <b0>   DW_AT_decl_file   : 1
    <b1>   DW_AT_decl_line   : 52
    <b2>   DW_AT_type        : <0xdd>
 <6><b6>: Abbrev Number: 0
 <5><b7>: Abbrev Number: 0
 <4><b8>: Abbrev Number: 0
 <3><b9>: Abbrev Number: 0
 <2><ba>: Abbrev Number: 0
 <1><bb>: Abbrev Number: 8 (DW_TAG_array_type)
    <bc>   DW_AT_type        : <0xc8>
 <2><c0>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c1>   DW_AT_type        : <0xcf>
    <c5>   DW_AT_lower_bound : 0
    <c6>   DW_AT_count       : 5
 <2><c7>: Abbrev Number: 0
 <1><c8>: Abbrev Number: 10 (DW_TAG_base_type)
    <c9>   DW_AT_name        : (indirect string, offset: 0x83db): u32
    <cd>   DW_AT_encoding    : 7	(unsigned)
    <ce>   DW_AT_byte_size   : 4
 <1><cf>: Abbrev Number: 11 (DW_TAG_base_type)
    <d0>   DW_AT_name        : (indirect string, offset: 0xbc): __ARRAY_SIZE_TYPE__
    <d4>   DW_AT_byte_size   : 8
    <d5>   DW_AT_encoding    : 7	(unsigned)
 <1><d6>: Abbrev Number: 10 (DW_TAG_base_type)
    <d7>   DW_AT_name        : (indirect string, offset: 0x3c76): u64
    <db>   DW_AT_encoding    : 7	(unsigned)
    <dc>   DW_AT_byte_size   : 8
 <1><dd>: Abbrev Number: 10 (DW_TAG_base_type)
    <de>   DW_AT_name        : (indirect string, offset: 0x2ddfe): usize
    <e2>   DW_AT_encoding    : 7	(unsigned)
    <e3>   DW_AT_byte_size   : 8
 <1><e4>: Abbrev Number: 0
  Compilation Unit @ offset 0xe5:
   Length:        0x6c9 (32-bit)
   Version:       4
   Abbrev Offset: 0x9b
   Pointer Size:  8
 <0><f0>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <f1>   DW_AT_producer    : (indirect string, offset: 0x0): clang LLVM (rustc version 1.67.0-nightly (a28f3c88e 2022-11-20))
    <f5>   DW_AT_language    : 28	(Rust)
    <f7>   DW_AT_name        : (indirect string, offset: 0xfb): src/lib.rs/@/serval_rust_examples.7801504a-cgu.1
    <fb>   DW_AT_stmt_list   : 0xe9
    <ff>   DW_AT_comp_dir    : (indirect string, offset: 0x72): /home/filippo/project_artifact/serval_rust_examples
    <103>   DW_AT_GNU_pubnames: 1
    <103>   DW_AT_low_pc      : 0x0
    <10b>   DW_AT_ranges      : 0x120
 <1><10f>: Abbrev Number: 2 (DW_TAG_namespace)
    <110>   DW_AT_name        : (indirect string, offset: 0x12c): core
 <2><114>: Abbrev Number: 2 (DW_TAG_namespace)
    <115>   DW_AT_name        : (indirect string, offset: 0x2d357): fmt
 <3><119>: Abbrev Number: 2 (DW_TAG_namespace)
    <11a>   DW_AT_name        : (indirect string, offset: 0x2ea58): rt
 <4><11e>: Abbrev Number: 2 (DW_TAG_namespace)
    <11f>   DW_AT_name        : (indirect string, offset: 0x913): v1
 <5><123>: Abbrev Number: 3 (DW_TAG_enumeration_type)
    <124>   DW_AT_type        : <0x4c7>
    <128>   DW_AT_enum_class  : 1
    <128>   DW_AT_name        : (indirect string, offset: 0x14b): Alignment
    <12c>   DW_AT_byte_size   : 1
    <12d>   DW_AT_alignment   : 1
 <6><12e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12f>   DW_AT_name        : (indirect string, offset: 0x131): Left
    <133>   DW_AT_const_value : 0
 <6><134>: Abbrev Number: 4 (DW_TAG_enumerator)
    <135>   DW_AT_name        : (indirect string, offset: 0x136): Right
    <139>   DW_AT_const_value : 1
 <6><13a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <13b>   DW_AT_name        : (indirect string, offset: 0x13c): Center
    <13f>   DW_AT_const_value : 2
 <6><140>: Abbrev Number: 4 (DW_TAG_enumerator)
    <141>   DW_AT_name        : (indirect string, offset: 0x143): Unknown
    <145>   DW_AT_const_value : 3
 <6><146>: Abbrev Number: 0
 <5><147>: Abbrev Number: 5 (DW_TAG_structure_type)
    <148>   DW_AT_name        : (indirect string, offset: 0x261): Argument
    <14c>   DW_AT_byte_size   : 56
    <14d>   DW_AT_alignment   : 8
 <6><14e>: Abbrev Number: 6 (DW_TAG_member)
    <14f>   DW_AT_name        : (indirect string, offset: 0x50f): position
    <153>   DW_AT_type        : <0x66c>
    <157>   DW_AT_alignment   : 8
    <158>   DW_AT_data_member_location: 0
 <6><159>: Abbrev Number: 6 (DW_TAG_member)
    <15a>   DW_AT_name        : (indirect string, offset: 0x219): format
    <15e>   DW_AT_type        : <0x165>
    <162>   DW_AT_alignment   : 8
    <163>   DW_AT_data_member_location: 8
 <6><164>: Abbrev Number: 0
 <5><165>: Abbrev Number: 5 (DW_TAG_structure_type)
    <166>   DW_AT_name        : (indirect string, offset: 0x256): FormatSpec
    <16a>   DW_AT_byte_size   : 48
    <16b>   DW_AT_alignment   : 8
 <6><16c>: Abbrev Number: 6 (DW_TAG_member)
    <16d>   DW_AT_name        : (indirect string, offset: 0x220): fill
    <171>   DW_AT_type        : <0x703>
    <175>   DW_AT_alignment   : 4
    <176>   DW_AT_data_member_location: 32
 <6><177>: Abbrev Number: 6 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x225): align
    <17c>   DW_AT_type        : <0x123>
    <180>   DW_AT_alignment   : 1
    <181>   DW_AT_data_member_location: 40
 <6><182>: Abbrev Number: 6 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x22b): flags
    <187>   DW_AT_type        : <0x610>
    <18b>   DW_AT_alignment   : 4
    <18c>   DW_AT_data_member_location: 36
 <6><18d>: Abbrev Number: 6 (DW_TAG_member)
    <18e>   DW_AT_name        : (indirect string, offset: 0x231): precision
    <192>   DW_AT_type        : <0x1a4>
    <196>   DW_AT_alignment   : 8
    <197>   DW_AT_data_member_location: 0
 <6><198>: Abbrev Number: 6 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x15533): width
    <19d>   DW_AT_type        : <0x1a4>
    <1a1>   DW_AT_alignment   : 8
    <1a2>   DW_AT_data_member_location: 16
 <6><1a3>: Abbrev Number: 0
 <5><1a4>: Abbrev Number: 5 (DW_TAG_structure_type)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x250): Count
    <1a9>   DW_AT_byte_size   : 16
    <1aa>   DW_AT_alignment   : 8
 <6><1ab>: Abbrev Number: 7 (DW_TAG_variant_part)
    <1ac>   DW_AT_discr       : <0x1b0>
 <7><1b0>: Abbrev Number: 8 (DW_TAG_member)
    <1b1>   DW_AT_type        : <0x67a>
    <1b5>   DW_AT_alignment   : 8
    <1b6>   DW_AT_data_member_location: 0
    <1b7>   DW_AT_artificial  : 1
 <7><1b7>: Abbrev Number: 9 (DW_TAG_variant)
    <1b8>   DW_AT_discr_value : 0
 <8><1b9>: Abbrev Number: 6 (DW_TAG_member)
    <1ba>   DW_AT_name        : (indirect string, offset: 0x23b): Is
    <1be>   DW_AT_type        : <0x1e2>
    <1c2>   DW_AT_alignment   : 8
    <1c3>   DW_AT_data_member_location: 0
 <8><1c4>: Abbrev Number: 0
 <7><1c5>: Abbrev Number: 9 (DW_TAG_variant)
    <1c6>   DW_AT_discr_value : 1
 <8><1c7>: Abbrev Number: 6 (DW_TAG_member)
    <1c8>   DW_AT_name        : (indirect string, offset: 0x242): Param
    <1cc>   DW_AT_type        : <0x1f5>
    <1d0>   DW_AT_alignment   : 8
    <1d1>   DW_AT_data_member_location: 0
 <8><1d2>: Abbrev Number: 0
 <7><1d3>: Abbrev Number: 9 (DW_TAG_variant)
    <1d4>   DW_AT_discr_value : 2
 <8><1d5>: Abbrev Number: 6 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x248): Implied
    <1da>   DW_AT_type        : <0x208>
    <1de>   DW_AT_alignment   : 8
    <1df>   DW_AT_data_member_location: 0
 <8><1e0>: Abbrev Number: 0
 <7><1e1>: Abbrev Number: 0
 <6><1e2>: Abbrev Number: 5 (DW_TAG_structure_type)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x23b): Is
    <1e7>   DW_AT_byte_size   : 16
    <1e8>   DW_AT_alignment   : 8
 <7><1e9>: Abbrev Number: 6 (DW_TAG_member)
    <1ea>   DW_AT_name        : (indirect string, offset: 0x23e): __0
    <1ee>   DW_AT_type        : <0x66c>
    <1f2>   DW_AT_alignment   : 8
    <1f3>   DW_AT_data_member_location: 8
 <7><1f4>: Abbrev Number: 0
 <6><1f5>: Abbrev Number: 5 (DW_TAG_structure_type)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x242): Param
    <1fa>   DW_AT_byte_size   : 16
    <1fb>   DW_AT_alignment   : 8
 <7><1fc>: Abbrev Number: 6 (DW_TAG_member)
    <1fd>   DW_AT_name        : (indirect string, offset: 0x23e): __0
    <201>   DW_AT_type        : <0x66c>
    <205>   DW_AT_alignment   : 8
    <206>   DW_AT_data_member_location: 8
 <7><207>: Abbrev Number: 0
 <6><208>: Abbrev Number: 10 (DW_TAG_structure_type)
    <209>   DW_AT_name        : (indirect string, offset: 0x248): Implied
    <20d>   DW_AT_byte_size   : 16
    <20e>   DW_AT_alignment   : 8
 <6><20f>: Abbrev Number: 0
 <5><210>: Abbrev Number: 0
 <4><211>: Abbrev Number: 0
 <3><212>: Abbrev Number: 5 (DW_TAG_structure_type)
    <213>   DW_AT_name        : (indirect string, offset: 0x3dc): Arguments
    <217>   DW_AT_byte_size   : 48
    <218>   DW_AT_alignment   : 8
 <4><219>: Abbrev Number: 6 (DW_TAG_member)
    <21a>   DW_AT_name        : (indirect string, offset: 0x1fc): pieces
    <21e>   DW_AT_type        : <0x68e>
    <222>   DW_AT_alignment   : 8
    <223>   DW_AT_data_member_location: 0
 <4><224>: Abbrev Number: 6 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x2d357): fmt
    <229>   DW_AT_type        : <0x389>
    <22d>   DW_AT_alignment   : 8
    <22e>   DW_AT_data_member_location: 16
 <4><22f>: Abbrev Number: 6 (DW_TAG_member)
    <230>   DW_AT_name        : (indirect string, offset: 0x2b7): args
    <234>   DW_AT_type        : <0x70a>
    <238>   DW_AT_alignment   : 8
    <239>   DW_AT_data_member_location: 32
 <4><23a>: Abbrev Number: 0
 <3><23b>: Abbrev Number: 5 (DW_TAG_structure_type)
    <23c>   DW_AT_name        : (indirect string, offset: 0x3ac): ArgumentV1
    <240>   DW_AT_byte_size   : 16
    <241>   DW_AT_alignment   : 8
 <4><242>: Abbrev Number: 6 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x2adb5): value
    <247>   DW_AT_type        : <0x731>
    <24b>   DW_AT_alignment   : 8
    <24c>   DW_AT_data_member_location: 0
 <4><24d>: Abbrev Number: 6 (DW_TAG_member)
    <24e>   DW_AT_name        : (indirect string, offset: 0x2e6): formatter
    <252>   DW_AT_type        : <0x73e>
    <256>   DW_AT_alignment   : 8
    <257>   DW_AT_data_member_location: 8
 <4><258>: Abbrev Number: 0
 <3><259>: Abbrev Number: 2 (DW_TAG_namespace)
    <25a>   DW_AT_name        : (indirect string, offset: 0x2bc): {extern#0}
 <4><25e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <25f>   DW_AT_name        : (indirect string, offset: 0x2df): Opaque
    <263>   DW_AT_byte_size   : 0
    <264>   DW_AT_alignment   : 1
 <4><265>: Abbrev Number: 0
 <3><266>: Abbrev Number: 10 (DW_TAG_structure_type)
    <267>   DW_AT_name        : (indirect string, offset: 0xb7bd): Error
    <26b>   DW_AT_byte_size   : 0
    <26c>   DW_AT_alignment   : 1
 <3><26d>: Abbrev Number: 5 (DW_TAG_structure_type)
    <26e>   DW_AT_name        : (indirect string, offset: 0x336): Formatter
    <272>   DW_AT_byte_size   : 64
    <273>   DW_AT_alignment   : 8
 <4><274>: Abbrev Number: 6 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x22b): flags
    <279>   DW_AT_type        : <0x610>
    <27d>   DW_AT_alignment   : 4
    <27e>   DW_AT_data_member_location: 48
 <4><27f>: Abbrev Number: 6 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x220): fill
    <284>   DW_AT_type        : <0x703>
    <288>   DW_AT_alignment   : 4
    <289>   DW_AT_data_member_location: 52
 <4><28a>: Abbrev Number: 6 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x225): align
    <28f>   DW_AT_type        : <0x123>
    <293>   DW_AT_alignment   : 1
    <294>   DW_AT_data_member_location: 56
 <4><295>: Abbrev Number: 6 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x15533): width
    <29a>   DW_AT_type        : <0x3e6>
    <29e>   DW_AT_alignment   : 8
    <29f>   DW_AT_data_member_location: 0
 <4><2a0>: Abbrev Number: 6 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x231): precision
    <2a5>   DW_AT_type        : <0x3e6>
    <2a9>   DW_AT_alignment   : 8
    <2aa>   DW_AT_data_member_location: 16
 <4><2ab>: Abbrev Number: 6 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x308): buf
    <2b0>   DW_AT_type        : <0x76f>
    <2b4>   DW_AT_alignment   : 8
    <2b5>   DW_AT_data_member_location: 32
 <4><2b6>: Abbrev Number: 0
 <3><2b7>: Abbrev Number: 0
 <2><2b8>: Abbrev Number: 2 (DW_TAG_namespace)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x172): panic
 <3><2bd>: Abbrev Number: 2 (DW_TAG_namespace)
    <2be>   DW_AT_name        : (indirect string, offset: 0x18f): panic_info
 <4><2c2>: Abbrev Number: 5 (DW_TAG_structure_type)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x466): PanicInfo
    <2c7>   DW_AT_byte_size   : 40
    <2c8>   DW_AT_alignment   : 8
 <5><2c9>: Abbrev Number: 6 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x19a): payload
    <2ce>   DW_AT_type        : <0x624>
    <2d2>   DW_AT_alignment   : 8
    <2d3>   DW_AT_data_member_location: 0
 <5><2d4>: Abbrev Number: 6 (DW_TAG_member)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x1e8): message
    <2d9>   DW_AT_type        : <0x32c>
    <2dd>   DW_AT_alignment   : 8
    <2de>   DW_AT_data_member_location: 16
 <5><2df>: Abbrev Number: 6 (DW_TAG_member)
    <2e0>   DW_AT_name        : (indirect string, offset: 0x404): location
    <2e4>   DW_AT_type        : <0x79d>
    <2e8>   DW_AT_alignment   : 8
    <2e9>   DW_AT_data_member_location: 24
 <5><2ea>: Abbrev Number: 6 (DW_TAG_member)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x43c): can_unwind
    <2ef>   DW_AT_type        : <0x7aa>
    <2f3>   DW_AT_alignment   : 1
    <2f4>   DW_AT_data_member_location: 32
 <5><2f5>: Abbrev Number: 0
 <4><2f6>: Abbrev Number: 0
 <3><2f7>: Abbrev Number: 2 (DW_TAG_namespace)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x404): location
 <4><2fc>: Abbrev Number: 5 (DW_TAG_structure_type)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x433): Location
    <301>   DW_AT_byte_size   : 24
    <302>   DW_AT_alignment   : 8
 <5><303>: Abbrev Number: 6 (DW_TAG_member)
    <304>   DW_AT_name        : (indirect string, offset: 0x40d): file
    <308>   DW_AT_type        : <0x6b5>
    <30c>   DW_AT_alignment   : 8
    <30d>   DW_AT_data_member_location: 0
 <5><30e>: Abbrev Number: 6 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x412): line
    <313>   DW_AT_type        : <0x610>
    <317>   DW_AT_alignment   : 4
    <318>   DW_AT_data_member_location: 16
 <5><319>: Abbrev Number: 6 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x417): col
    <31e>   DW_AT_type        : <0x610>
    <322>   DW_AT_alignment   : 4
    <323>   DW_AT_data_member_location: 20
 <5><324>: Abbrev Number: 0
 <4><325>: Abbrev Number: 0
 <3><326>: Abbrev Number: 0
 <2><327>: Abbrev Number: 2 (DW_TAG_namespace)
    <328>   DW_AT_name        : (indirect string, offset: 0x1f0): option
 <3><32c>: Abbrev Number: 5 (DW_TAG_structure_type)
    <32d>   DW_AT_name        : (indirect string, offset: 0x3e6): Option<&core::fmt::Arguments>
    <331>   DW_AT_byte_size   : 8
    <332>   DW_AT_alignment   : 8
 <4><333>: Abbrev Number: 7 (DW_TAG_variant_part)
    <334>   DW_AT_discr       : <0x338>
 <5><338>: Abbrev Number: 8 (DW_TAG_member)
    <339>   DW_AT_type        : <0x67a>
    <33d>   DW_AT_alignment   : 8
    <33e>   DW_AT_data_member_location: 0
    <33f>   DW_AT_artificial  : 1
 <5><33f>: Abbrev Number: 9 (DW_TAG_variant)
    <340>   DW_AT_discr_value : 0
 <6><341>: Abbrev Number: 6 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x1f7): None
    <346>   DW_AT_type        : <0x35b>
    <34a>   DW_AT_alignment   : 8
    <34b>   DW_AT_data_member_location: 0
 <6><34c>: Abbrev Number: 0
 <5><34d>: Abbrev Number: 11 (DW_TAG_variant)
 <6><34e>: Abbrev Number: 6 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x28b): Some
    <353>   DW_AT_type        : <0x36c>
    <357>   DW_AT_alignment   : 8
    <358>   DW_AT_data_member_location: 0
 <6><359>: Abbrev Number: 0
 <5><35a>: Abbrev Number: 0
 <4><35b>: Abbrev Number: 5 (DW_TAG_structure_type)
    <35c>   DW_AT_name        : (indirect string, offset: 0x1f7): None
    <360>   DW_AT_byte_size   : 8
    <361>   DW_AT_alignment   : 8
 <5><362>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <363>   DW_AT_type        : <0x681>
    <367>   DW_AT_name        : (indirect string, offset: 0x289): T
 <5><36b>: Abbrev Number: 0
 <4><36c>: Abbrev Number: 5 (DW_TAG_structure_type)
    <36d>   DW_AT_name        : (indirect string, offset: 0x28b): Some
    <371>   DW_AT_byte_size   : 8
    <372>   DW_AT_alignment   : 8
 <5><373>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <374>   DW_AT_type        : <0x681>
    <378>   DW_AT_name        : (indirect string, offset: 0x289): T
 <5><37c>: Abbrev Number: 6 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x23e): __0
    <381>   DW_AT_type        : <0x681>
    <385>   DW_AT_alignment   : 8
    <386>   DW_AT_data_member_location: 0
 <5><387>: Abbrev Number: 0
 <4><388>: Abbrev Number: 0
 <3><389>: Abbrev Number: 5 (DW_TAG_structure_type)
    <38a>   DW_AT_name        : (indirect string, offset: 0x290): Option<&[core::fmt::rt::v1::Argument]>
    <38e>   DW_AT_byte_size   : 16
    <38f>   DW_AT_alignment   : 8
 <4><390>: Abbrev Number: 7 (DW_TAG_variant_part)
    <391>   DW_AT_discr       : <0x395>
 <5><395>: Abbrev Number: 8 (DW_TAG_member)
    <396>   DW_AT_type        : <0x67a>
    <39a>   DW_AT_alignment   : 8
    <39b>   DW_AT_data_member_location: 0
    <39c>   DW_AT_artificial  : 1
 <5><39c>: Abbrev Number: 9 (DW_TAG_variant)
    <39d>   DW_AT_discr_value : 0
 <6><39e>: Abbrev Number: 6 (DW_TAG_member)
    <39f>   DW_AT_name        : (indirect string, offset: 0x1f7): None
    <3a3>   DW_AT_type        : <0x3b8>
    <3a7>   DW_AT_alignment   : 8
    <3a8>   DW_AT_data_member_location: 0
 <6><3a9>: Abbrev Number: 0
 <5><3aa>: Abbrev Number: 11 (DW_TAG_variant)
 <6><3ab>: Abbrev Number: 6 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x28b): Some
    <3b0>   DW_AT_type        : <0x3c9>
    <3b4>   DW_AT_alignment   : 8
    <3b5>   DW_AT_data_member_location: 0
 <6><3b6>: Abbrev Number: 0
 <5><3b7>: Abbrev Number: 0
 <4><3b8>: Abbrev Number: 5 (DW_TAG_structure_type)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x1f7): None
    <3bd>   DW_AT_byte_size   : 16
    <3be>   DW_AT_alignment   : 8
 <5><3bf>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <3c0>   DW_AT_type        : <0x6dc>
    <3c4>   DW_AT_name        : (indirect string, offset: 0x289): T
 <5><3c8>: Abbrev Number: 0
 <4><3c9>: Abbrev Number: 5 (DW_TAG_structure_type)
    <3ca>   DW_AT_name        : (indirect string, offset: 0x28b): Some
    <3ce>   DW_AT_byte_size   : 16
    <3cf>   DW_AT_alignment   : 8
 <5><3d0>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <3d1>   DW_AT_type        : <0x6dc>
    <3d5>   DW_AT_name        : (indirect string, offset: 0x289): T
 <5><3d9>: Abbrev Number: 6 (DW_TAG_member)
    <3da>   DW_AT_name        : (indirect string, offset: 0x23e): __0
    <3de>   DW_AT_type        : <0x6dc>
    <3e2>   DW_AT_alignment   : 8
    <3e3>   DW_AT_data_member_location: 0
 <5><3e4>: Abbrev Number: 0
 <4><3e5>: Abbrev Number: 0
 <3><3e6>: Abbrev Number: 5 (DW_TAG_structure_type)
    <3e7>   DW_AT_name        : (indirect string, offset: 0x2fa): Option<usize>
    <3eb>   DW_AT_byte_size   : 16
    <3ec>   DW_AT_alignment   : 8
 <4><3ed>: Abbrev Number: 7 (DW_TAG_variant_part)
    <3ee>   DW_AT_discr       : <0x3f2>
 <5><3f2>: Abbrev Number: 8 (DW_TAG_member)
    <3f3>   DW_AT_type        : <0x67a>
    <3f7>   DW_AT_alignment   : 8
    <3f8>   DW_AT_data_member_location: 0
    <3f9>   DW_AT_artificial  : 1
 <5><3f9>: Abbrev Number: 9 (DW_TAG_variant)
    <3fa>   DW_AT_discr_value : 0
 <6><3fb>: Abbrev Number: 6 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x1f7): None
    <400>   DW_AT_type        : <0x416>
    <404>   DW_AT_alignment   : 8
    <405>   DW_AT_data_member_location: 0
 <6><406>: Abbrev Number: 0
 <5><407>: Abbrev Number: 9 (DW_TAG_variant)
    <408>   DW_AT_discr_value : 1
 <6><409>: Abbrev Number: 6 (DW_TAG_member)
    <40a>   DW_AT_name        : (indirect string, offset: 0x28b): Some
    <40e>   DW_AT_type        : <0x427>
    <412>   DW_AT_alignment   : 8
    <413>   DW_AT_data_member_location: 0
 <6><414>: Abbrev Number: 0
 <5><415>: Abbrev Number: 0
 <4><416>: Abbrev Number: 5 (DW_TAG_structure_type)
    <417>   DW_AT_name        : (indirect string, offset: 0x1f7): None
    <41b>   DW_AT_byte_size   : 16
    <41c>   DW_AT_alignment   : 8
 <5><41d>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <41e>   DW_AT_type        : <0x66c>
    <422>   DW_AT_name        : (indirect string, offset: 0x289): T
 <5><426>: Abbrev Number: 0
 <4><427>: Abbrev Number: 5 (DW_TAG_structure_type)
    <428>   DW_AT_name        : (indirect string, offset: 0x28b): Some
    <42c>   DW_AT_byte_size   : 16
    <42d>   DW_AT_alignment   : 8
 <5><42e>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <42f>   DW_AT_type        : <0x66c>
    <433>   DW_AT_name        : (indirect string, offset: 0x289): T
 <5><437>: Abbrev Number: 6 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0x23e): __0
    <43c>   DW_AT_type        : <0x66c>
    <440>   DW_AT_alignment   : 8
    <441>   DW_AT_data_member_location: 8
 <5><442>: Abbrev Number: 0
 <4><443>: Abbrev Number: 0
 <3><444>: Abbrev Number: 0
 <2><445>: Abbrev Number: 2 (DW_TAG_namespace)
    <446>   DW_AT_name        : (indirect string, offset: 0xf4): result
 <3><44a>: Abbrev Number: 5 (DW_TAG_structure_type)
    <44b>   DW_AT_name        : (indirect string, offset: 0x38f): Result<(), core::fmt::Error>
    <44f>   DW_AT_byte_size   : 1
    <450>   DW_AT_alignment   : 1
 <4><451>: Abbrev Number: 7 (DW_TAG_variant_part)
    <452>   DW_AT_discr       : <0x456>
 <5><456>: Abbrev Number: 8 (DW_TAG_member)
    <457>   DW_AT_type        : <0x4c7>
    <45b>   DW_AT_alignment   : 1
    <45c>   DW_AT_data_member_location: 0
    <45d>   DW_AT_artificial  : 1
 <5><45d>: Abbrev Number: 9 (DW_TAG_variant)
    <45e>   DW_AT_discr_value : 0
 <6><45f>: Abbrev Number: 6 (DW_TAG_member)
    <460>   DW_AT_name        : (indirect string, offset: 0x2f0): Ok
    <464>   DW_AT_type        : <0x47a>
    <468>   DW_AT_alignment   : 1
    <469>   DW_AT_data_member_location: 0
 <6><46a>: Abbrev Number: 0
 <5><46b>: Abbrev Number: 9 (DW_TAG_variant)
    <46c>   DW_AT_discr_value : 1
 <6><46d>: Abbrev Number: 6 (DW_TAG_member)
    <46e>   DW_AT_name        : (indirect string, offset: 0x2f6): Err
    <472>   DW_AT_type        : <0x49f>
    <476>   DW_AT_alignment   : 1
    <477>   DW_AT_data_member_location: 0
 <6><478>: Abbrev Number: 0
 <5><479>: Abbrev Number: 0
 <4><47a>: Abbrev Number: 5 (DW_TAG_structure_type)
    <47b>   DW_AT_name        : (indirect string, offset: 0x2f0): Ok
    <47f>   DW_AT_byte_size   : 1
    <480>   DW_AT_alignment   : 1
 <5><481>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <482>   DW_AT_type        : <0x75b>
    <486>   DW_AT_name        : (indirect string, offset: 0x289): T
 <5><48a>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <48b>   DW_AT_type        : <0x266>
    <48f>   DW_AT_name        : (indirect string, offset: 0xd1d7): E
 <5><493>: Abbrev Number: 6 (DW_TAG_member)
    <494>   DW_AT_name        : (indirect string, offset: 0x23e): __0
    <498>   DW_AT_type        : <0x75b>
    <49c>   DW_AT_alignment   : 1
    <49d>   DW_AT_data_member_location: 1
 <5><49e>: Abbrev Number: 0
 <4><49f>: Abbrev Number: 5 (DW_TAG_structure_type)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x2f6): Err
    <4a4>   DW_AT_byte_size   : 1
    <4a5>   DW_AT_alignment   : 1
 <5><4a6>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <4a7>   DW_AT_type        : <0x75b>
    <4ab>   DW_AT_name        : (indirect string, offset: 0x289): T
 <5><4af>: Abbrev Number: 12 (DW_TAG_template_type_param)
    <4b0>   DW_AT_type        : <0x266>
    <4b4>   DW_AT_name        : (indirect string, offset: 0xd1d7): E
 <5><4b8>: Abbrev Number: 6 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0x23e): __0
    <4bd>   DW_AT_type        : <0x266>
    <4c1>   DW_AT_alignment   : 1
    <4c2>   DW_AT_data_member_location: 1
 <5><4c3>: Abbrev Number: 0
 <4><4c4>: Abbrev Number: 0
 <3><4c5>: Abbrev Number: 0
 <2><4c6>: Abbrev Number: 0
 <1><4c7>: Abbrev Number: 13 (DW_TAG_base_type)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x3292c): u8
    <4cc>   DW_AT_encoding    : 7	(unsigned)
    <4cd>   DW_AT_byte_size   : 1
 <1><4ce>: Abbrev Number: 2 (DW_TAG_namespace)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x91): serval_rust_examples
 <2><4d3>: Abbrev Number: 14 (DW_TAG_subprogram)
    <4d4>   DW_AT_low_pc      : 0xa54
    <4dc>   DW_AT_high_pc     : 0x5e
    <4e0>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <4e2>   DW_AT_name        : (indirect string, offset: 0x155): double_sum
    <4e6>   DW_AT_decl_file   : 1
    <4e7>   DW_AT_decl_line   : 48
    <4e8>   DW_AT_type        : <0x610>
    <4ec>   DW_AT_external    : 1
 <3><4ec>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <4ed>   DW_AT_location    : 2 byte block: 91 10 	(DW_OP_fbreg: 16)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x189): xp
    <4f4>   DW_AT_decl_file   : 1
    <4f5>   DW_AT_decl_line   : 48
    <4f6>   DW_AT_type        : <0x610>
 <3><4fa>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <4fb>   DW_AT_location    : 2 byte block: 91 14 	(DW_OP_fbreg: 20)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x18c): yp
    <502>   DW_AT_decl_file   : 1
    <503>   DW_AT_decl_line   : 48
    <504>   DW_AT_type        : <0x610>
 <3><508>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <509>   DW_AT_ranges      : 0x90
 <4><50d>: Abbrev Number: 17 (DW_TAG_variable)
    <50e>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
    <511>   DW_AT_name        : (indirect string, offset: 0xd92): x
    <515>   DW_AT_decl_file   : 1
    <516>   DW_AT_decl_line   : 49
    <517>   DW_AT_type        : <0x610>
 <4><51b>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <51c>   DW_AT_ranges      : 0xc0
 <5><520>: Abbrev Number: 17 (DW_TAG_variable)
    <521>   DW_AT_location    : 2 byte block: 91 c 	(DW_OP_fbreg: 12)
    <524>   DW_AT_name        : (indirect string, offset: 0xf2): y
    <528>   DW_AT_decl_file   : 1
    <529>   DW_AT_decl_line   : 50
    <52a>   DW_AT_type        : <0x610>
 <5><52e>: Abbrev Number: 0
 <4><52f>: Abbrev Number: 0
 <3><530>: Abbrev Number: 0
 <2><531>: Abbrev Number: 18 (DW_TAG_subprogram)
    <532>   DW_AT_low_pc      : 0xab2
    <53a>   DW_AT_high_pc     : 0x8
    <53e>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <540>   DW_AT_linkage_name: (indirect string, offset: 0x160): rust_begin_unwind
    <544>   DW_AT_name        : (indirect string, offset: 0x172): panic
    <548>   DW_AT_decl_file   : 1
    <549>   DW_AT_decl_line   : 60
    <54a>   DW_AT_noreturn    : 1
 <3><54a>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <54b>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
    <54e>   DW_AT_name        : (indirect string, offset: 0x194): _info
    <552>   DW_AT_decl_file   : 1
    <553>   DW_AT_decl_line   : 60
    <554>   DW_AT_type        : <0x617>
 <3><558>: Abbrev Number: 0
 <2><559>: Abbrev Number: 14 (DW_TAG_subprogram)
    <55a>   DW_AT_low_pc      : 0xaba
    <562>   DW_AT_high_pc     : 0xe
    <566>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <568>   DW_AT_name        : (indirect string, offset: 0xdff2): test
    <56c>   DW_AT_decl_file   : 1
    <56d>   DW_AT_decl_line   : 10
    <56e>   DW_AT_type        : <0x610>
    <572>   DW_AT_external    : 1
 <3><572>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <573>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
    <576>   DW_AT_name        : (indirect string, offset: 0xd92): x
    <57a>   DW_AT_decl_file   : 1
    <57b>   DW_AT_decl_line   : 20
    <57c>   DW_AT_type        : <0x610>
 <3><580>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <581>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
    <584>   DW_AT_name        : (indirect string, offset: 0xf2): y
    <588>   DW_AT_decl_file   : 1
    <589>   DW_AT_decl_line   : 20
    <58a>   DW_AT_type        : <0x610>
 <3><58e>: Abbrev Number: 0
 <2><58f>: Abbrev Number: 14 (DW_TAG_subprogram)
    <590>   DW_AT_low_pc      : 0xac8
    <598>   DW_AT_high_pc     : 0x7c
    <59c>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <59e>   DW_AT_name        : (indirect string, offset: 0x178): equality
    <5a2>   DW_AT_decl_file   : 1
    <5a3>   DW_AT_decl_line   : 25
    <5a4>   DW_AT_type        : <0x4c7>
    <5a8>   DW_AT_external    : 1
 <3><5a8>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <5a9>   DW_AT_location    : 2 byte block: 91 18 	(DW_OP_fbreg: 24)
    <5ac>   DW_AT_name        : (indirect string, offset: 0xd92): x
    <5b0>   DW_AT_decl_file   : 1
    <5b1>   DW_AT_decl_line   : 39
    <5b2>   DW_AT_type        : <0x610>
 <3><5b6>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <5b7>   DW_AT_location    : 2 byte block: 91 1c 	(DW_OP_fbreg: 28)
    <5ba>   DW_AT_name        : (indirect string, offset: 0xf2): y
    <5be>   DW_AT_decl_file   : 1
    <5bf>   DW_AT_decl_line   : 39
    <5c0>   DW_AT_type        : <0x610>
 <3><5c4>: Abbrev Number: 0
 <2><5c5>: Abbrev Number: 14 (DW_TAG_subprogram)
    <5c6>   DW_AT_low_pc      : 0xb44
    <5ce>   DW_AT_high_pc     : 0x38
    <5d2>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <5d4>   DW_AT_name        : (indirect string, offset: 0x181): example
    <5d8>   DW_AT_decl_file   : 1
    <5d9>   DW_AT_decl_line   : 87
    <5da>   DW_AT_type        : <0x610>
    <5de>   DW_AT_external    : 1
 <3><5de>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <5df>   DW_AT_location    : 2 byte block: 91 18 	(DW_OP_fbreg: 24)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x280e7): a
    <5e6>   DW_AT_decl_file   : 1
    <5e7>   DW_AT_decl_line   : 98
    <5e8>   DW_AT_type        : <0x610>
 <3><5ec>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <5ed>   DW_AT_location    : 2 byte block: 91 1c 	(DW_OP_fbreg: 28)
    <5f0>   DW_AT_name        : (indirect string, offset: 0xb441): b
    <5f4>   DW_AT_decl_file   : 1
    <5f5>   DW_AT_decl_line   : 98
    <5f6>   DW_AT_type        : <0x610>
 <3><5fa>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <5fb>   DW_AT_ranges      : 0xf0
 <4><5ff>: Abbrev Number: 17 (DW_TAG_variable)
    <600>   DW_AT_location    : 2 byte block: 91 14 	(DW_OP_fbreg: 20)
    <603>   DW_AT_name        : (indirect string, offset: 0x29266): c
    <607>   DW_AT_decl_file   : 1
    <608>   DW_AT_decl_line   : 99
    <609>   DW_AT_type        : <0x610>
 <4><60d>: Abbrev Number: 0
 <3><60e>: Abbrev Number: 0
 <2><60f>: Abbrev Number: 0
 <1><610>: Abbrev Number: 13 (DW_TAG_base_type)
    <611>   DW_AT_name        : (indirect string, offset: 0x83db): u32
    <615>   DW_AT_encoding    : 7	(unsigned)
    <616>   DW_AT_byte_size   : 4
 <1><617>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <618>   DW_AT_type        : <0x2c2>
    <61c>   DW_AT_name        : (indirect string, offset: 0x44c): &core::panic::panic_info::PanicInfo
    <620>   DW_AT_address_class: 0x0
 <1><624>: Abbrev Number: 5 (DW_TAG_structure_type)
    <625>   DW_AT_name        : (indirect string, offset: 0x1bd): &(dyn core::any::Any + core::marker::Send)
    <629>   DW_AT_byte_size   : 16
    <62a>   DW_AT_alignment   : 8
 <2><62b>: Abbrev Number: 6 (DW_TAG_member)
    <62c>   DW_AT_name        : (indirect string, offset: 0x1a2): pointer
    <630>   DW_AT_type        : <0x642>
    <634>   DW_AT_alignment   : 8
    <635>   DW_AT_data_member_location: 0
 <2><636>: Abbrev Number: 6 (DW_TAG_member)
    <637>   DW_AT_name        : (indirect string, offset: 0x1aa): vtable
    <63b>   DW_AT_type        : <0x652>
    <63f>   DW_AT_alignment   : 8
    <640>   DW_AT_data_member_location: 8
 <2><641>: Abbrev Number: 0
 <1><642>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <643>   DW_AT_type        : <0x64b>
    <647>   DW_AT_address_class: 0x0
 <1><64b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <64c>   DW_AT_name        : (indirect string, offset: 0x1be): (dyn core::any::Any + core::marker::Send)
    <650>   DW_AT_byte_size   : 0
    <651>   DW_AT_alignment   : 1
 <1><652>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <653>   DW_AT_type        : <0x65f>
    <657>   DW_AT_name        : (indirect string, offset: 0x1b1): &[usize; 3]
    <65b>   DW_AT_address_class: 0x0
 <1><65f>: Abbrev Number: 21 (DW_TAG_array_type)
    <660>   DW_AT_type        : <0x66c>
 <2><664>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <665>   DW_AT_type        : <0x673>
    <669>   DW_AT_lower_bound : 0
    <66a>   DW_AT_count       : 3
 <2><66b>: Abbrev Number: 0
 <1><66c>: Abbrev Number: 13 (DW_TAG_base_type)
    <66d>   DW_AT_name        : (indirect string, offset: 0x2ddfe): usize
    <671>   DW_AT_encoding    : 7	(unsigned)
    <672>   DW_AT_byte_size   : 8
 <1><673>: Abbrev Number: 23 (DW_TAG_base_type)
    <674>   DW_AT_name        : (indirect string, offset: 0xbc): __ARRAY_SIZE_TYPE__
    <678>   DW_AT_byte_size   : 8
    <679>   DW_AT_encoding    : 7	(unsigned)
 <1><67a>: Abbrev Number: 13 (DW_TAG_base_type)
    <67b>   DW_AT_name        : (indirect string, offset: 0x3c76): u64
    <67f>   DW_AT_encoding    : 7	(unsigned)
    <680>   DW_AT_byte_size   : 8
 <1><681>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <682>   DW_AT_type        : <0x212>
    <686>   DW_AT_name        : (indirect string, offset: 0x3d0): &core::fmt::Arguments
    <68a>   DW_AT_address_class: 0x0
 <1><68e>: Abbrev Number: 5 (DW_TAG_structure_type)
    <68f>   DW_AT_name        : (indirect string, offset: 0x211): &[&str]
    <693>   DW_AT_byte_size   : 16
    <694>   DW_AT_alignment   : 8
 <2><695>: Abbrev Number: 6 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0x203): data_ptr
    <69a>   DW_AT_type        : <0x6ac>
    <69e>   DW_AT_alignment   : 8
    <69f>   DW_AT_data_member_location: 0
 <2><6a0>: Abbrev Number: 6 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x28655): length
    <6a5>   DW_AT_type        : <0x66c>
    <6a9>   DW_AT_alignment   : 8
    <6aa>   DW_AT_data_member_location: 8
 <2><6ab>: Abbrev Number: 0
 <1><6ac>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <6ad>   DW_AT_type        : <0x6b5>
    <6b1>   DW_AT_address_class: 0x0
 <1><6b5>: Abbrev Number: 5 (DW_TAG_structure_type)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x20c): &str
    <6ba>   DW_AT_byte_size   : 16
    <6bb>   DW_AT_alignment   : 8
 <2><6bc>: Abbrev Number: 6 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x203): data_ptr
    <6c1>   DW_AT_type        : <0x6d3>
    <6c5>   DW_AT_alignment   : 8
    <6c6>   DW_AT_data_member_location: 0
 <2><6c7>: Abbrev Number: 6 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x28655): length
    <6cc>   DW_AT_type        : <0x66c>
    <6d0>   DW_AT_alignment   : 8
    <6d1>   DW_AT_data_member_location: 8
 <2><6d2>: Abbrev Number: 0
 <1><6d3>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <6d4>   DW_AT_type        : <0x4c7>
    <6d8>   DW_AT_address_class: 0x0
 <1><6dc>: Abbrev Number: 5 (DW_TAG_structure_type)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x26a): &[core::fmt::rt::v1::Argument]
    <6e1>   DW_AT_byte_size   : 16
    <6e2>   DW_AT_alignment   : 8
 <2><6e3>: Abbrev Number: 6 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x203): data_ptr
    <6e8>   DW_AT_type        : <0x6fa>
    <6ec>   DW_AT_alignment   : 8
    <6ed>   DW_AT_data_member_location: 0
 <2><6ee>: Abbrev Number: 6 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0x28655): length
    <6f3>   DW_AT_type        : <0x66c>
    <6f7>   DW_AT_alignment   : 8
    <6f8>   DW_AT_data_member_location: 8
 <2><6f9>: Abbrev Number: 0
 <1><6fa>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <6fb>   DW_AT_type        : <0x147>
    <6ff>   DW_AT_address_class: 0x0
 <1><703>: Abbrev Number: 13 (DW_TAG_base_type)
    <704>   DW_AT_name        : (indirect string, offset: 0xba47): char
    <708>   DW_AT_encoding    : 16	(unicode string)
    <709>   DW_AT_byte_size   : 4
 <1><70a>: Abbrev Number: 5 (DW_TAG_structure_type)
    <70b>   DW_AT_name        : (indirect string, offset: 0x3b7): &[core::fmt::ArgumentV1]
    <70f>   DW_AT_byte_size   : 16
    <710>   DW_AT_alignment   : 8
 <2><711>: Abbrev Number: 6 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0x203): data_ptr
    <716>   DW_AT_type        : <0x728>
    <71a>   DW_AT_alignment   : 8
    <71b>   DW_AT_data_member_location: 0
 <2><71c>: Abbrev Number: 6 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x28655): length
    <721>   DW_AT_type        : <0x66c>
    <725>   DW_AT_alignment   : 8
    <726>   DW_AT_data_member_location: 8
 <2><727>: Abbrev Number: 0
 <1><728>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <729>   DW_AT_type        : <0x23b>
    <72d>   DW_AT_address_class: 0x0
 <1><731>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <732>   DW_AT_type        : <0x25e>
    <736>   DW_AT_name        : (indirect string, offset: 0x2c7): &core::fmt::{extern#0}::Opaque
    <73a>   DW_AT_address_class: 0x0
 <1><73e>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <73f>   DW_AT_type        : <0x74b>
    <743>   DW_AT_name        : (indirect string, offset: 0x340): fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>
    <747>   DW_AT_address_class: 0x0
 <1><74b>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <74c>   DW_AT_type        : <0x44a>
 <2><750>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <751>   DW_AT_type        : <0x731>
 <2><755>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <756>   DW_AT_type        : <0x762>
 <2><75a>: Abbrev Number: 0
 <1><75b>: Abbrev Number: 13 (DW_TAG_base_type)
    <75c>   DW_AT_name        : (indirect string, offset: 0x2f3): ()
    <760>   DW_AT_encoding    : 7	(unsigned)
    <761>   DW_AT_byte_size   : 0
 <1><762>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <763>   DW_AT_type        : <0x26d>
    <767>   DW_AT_name        : (indirect string, offset: 0x326): &mut core::fmt::Formatter
    <76b>   DW_AT_address_class: 0x0
 <1><76f>: Abbrev Number: 5 (DW_TAG_structure_type)
    <770>   DW_AT_name        : (indirect string, offset: 0x30c): &mut dyn core::fmt::Write
    <774>   DW_AT_byte_size   : 16
    <775>   DW_AT_alignment   : 8
 <2><776>: Abbrev Number: 6 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x1a2): pointer
    <77b>   DW_AT_type        : <0x78d>
    <77f>   DW_AT_alignment   : 8
    <780>   DW_AT_data_member_location: 0
 <2><781>: Abbrev Number: 6 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x1aa): vtable
    <786>   DW_AT_type        : <0x652>
    <78a>   DW_AT_alignment   : 8
    <78b>   DW_AT_data_member_location: 8
 <2><78c>: Abbrev Number: 0
 <1><78d>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <78e>   DW_AT_type        : <0x796>
    <792>   DW_AT_address_class: 0x0
 <1><796>: Abbrev Number: 10 (DW_TAG_structure_type)
    <797>   DW_AT_name        : (indirect string, offset: 0x311): dyn core::fmt::Write
    <79b>   DW_AT_byte_size   : 0
    <79c>   DW_AT_alignment   : 1
 <1><79d>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <79e>   DW_AT_type        : <0x2fc>
    <7a2>   DW_AT_name        : (indirect string, offset: 0x41b): &core::panic::location::Location
    <7a6>   DW_AT_address_class: 0x0
 <1><7aa>: Abbrev Number: 13 (DW_TAG_base_type)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x447): bool
    <7af>   DW_AT_encoding    : 2	(boolean)
    <7b0>   DW_AT_byte_size   : 1
 <1><7b1>: Abbrev Number: 0
  Compilation Unit @ offset 0x7b2:
   Length:        0x1dd (32-bit)
   Version:       4
   Abbrev Offset: 0x1bc
   Pointer Size:  8
 <0><7bd>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <7be>   DW_AT_producer    : (indirect string, offset: 0x0): clang LLVM (rustc version 1.67.0-nightly (a28f3c88e 2022-11-20))
    <7c2>   DW_AT_language    : 28	(Rust)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x470): src/lib.rs/@/serval_rust_examples.7801504a-cgu.2
    <7c8>   DW_AT_stmt_list   : 0x2cc
    <7cc>   DW_AT_comp_dir    : (indirect string, offset: 0x72): /home/filippo/project_artifact/serval_rust_examples
    <7d0>   DW_AT_GNU_pubnames: 1
    <7d0>   DW_AT_low_pc      : 0x0
    <7d8>   DW_AT_ranges      : 0x240
 <1><7dc>: Abbrev Number: 2 (DW_TAG_namespace)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x91): serval_rust_examples
 <2><7e1>: Abbrev Number: 2 (DW_TAG_namespace)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x4a1): libmonitor
 <3><7e6>: Abbrev Number: 3 (DW_TAG_variable)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x4ac): regions
    <7eb>   DW_AT_type        : <0x95c>
    <7ef>   DW_AT_external    : 1
    <7ef>   DW_AT_decl_file   : 1
    <7f0>   DW_AT_decl_line   : 33
    <7f1>   DW_AT_alignment   : 4
    <7f2>   DW_AT_location    : 9 byte block: 3 1c 30 0 0 0 0 0 0 	(DW_OP_addr: 301c)
 <3><7fc>: Abbrev Number: 4 (DW_TAG_structure_type)
    <7fd>   DW_AT_name        : (indirect string, offset: 0x4c1): Region
    <801>   DW_AT_byte_size   : 8
    <802>   DW_AT_alignment   : 4
 <4><803>: Abbrev Number: 5 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0x4b4): container_id
    <808>   DW_AT_type        : <0x969>
    <80c>   DW_AT_alignment   : 4
    <80d>   DW_AT_data_member_location: 0
 <4><80e>: Abbrev Number: 5 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0x2ad31): valid
    <813>   DW_AT_type        : <0x970>
    <817>   DW_AT_alignment   : 1
    <818>   DW_AT_data_member_location: 4
 <4><819>: Abbrev Number: 0
 <3><81a>: Abbrev Number: 3 (DW_TAG_variable)
    <81b>   DW_AT_name        : (indirect string, offset: 0x4c8): containers
    <81f>   DW_AT_type        : <0x97e>
    <823>   DW_AT_external    : 1
    <823>   DW_AT_decl_file   : 1
    <824>   DW_AT_decl_line   : 37
    <825>   DW_AT_alignment   : 4
    <826>   DW_AT_location    : 9 byte block: 3 44 34 0 0 0 0 0 0 	(DW_OP_addr: 3444)
 <3><830>: Abbrev Number: 4 (DW_TAG_structure_type)
    <831>   DW_AT_name        : (indirect string, offset: 0x4e0): Container
    <835>   DW_AT_byte_size   : 8
    <836>   DW_AT_alignment   : 4
 <4><837>: Abbrev Number: 5 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0x4be): id
    <83c>   DW_AT_type        : <0x969>
    <840>   DW_AT_alignment   : 4
    <841>   DW_AT_data_member_location: 0
 <4><842>: Abbrev Number: 5 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x4d3): region_count
    <847>   DW_AT_type        : <0x969>
    <84b>   DW_AT_alignment   : 4
    <84c>   DW_AT_data_member_location: 4
 <4><84d>: Abbrev Number: 0
 <3><84e>: Abbrev Number: 6 (DW_TAG_subprogram)
    <84f>   DW_AT_low_pc      : 0xb7c
    <857>   DW_AT_high_pc     : 0x11c
    <85b>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <85d>   DW_AT_name        : (indirect string, offset: 0x4ea): init_memory
    <861>   DW_AT_decl_file   : 1
    <862>   DW_AT_decl_line   : 41
    <863>   DW_AT_external    : 1
 <4><863>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <864>   DW_AT_ranges      : 0x180
 <5><868>: Abbrev Number: 8 (DW_TAG_variable)
    <869>   DW_AT_location    : 2 byte block: 91 28 	(DW_OP_fbreg: 40)
    <86c>   DW_AT_name        : (indirect string, offset: 0xae9b): i
    <870>   DW_AT_alignment   : 1
    <871>   DW_AT_decl_file   : 1
    <872>   DW_AT_decl_line   : 42
    <873>   DW_AT_type        : <0x98b>
 <5><877>: Abbrev Number: 0
 <4><878>: Abbrev Number: 0
 <3><879>: Abbrev Number: 9 (DW_TAG_subprogram)
    <87a>   DW_AT_low_pc      : 0xc98
    <882>   DW_AT_high_pc     : 0x106
    <886>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <888>   DW_AT_name        : (indirect string, offset: 0x4f6): init_container
    <88c>   DW_AT_decl_file   : 1
    <88d>   DW_AT_decl_line   : 61
    <88e>   DW_AT_type        : <0x970>
    <892>   DW_AT_external    : 1
 <4><892>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <893>   DW_AT_location    : 3 byte block: 91 c4 0 	(DW_OP_fbreg: 68)
    <897>   DW_AT_name        : (indirect string, offset: 0x4b4): container_id
    <89b>   DW_AT_decl_file   : 1
    <89c>   DW_AT_decl_line   : 61
    <89d>   DW_AT_type        : <0x969>
 <4><8a1>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <8a2>   DW_AT_ranges      : 0x1b0
 <5><8a6>: Abbrev Number: 8 (DW_TAG_variable)
    <8a7>   DW_AT_location    : 2 byte block: 91 38 	(DW_OP_fbreg: 56)
    <8aa>   DW_AT_name        : (indirect string, offset: 0xae9b): i
    <8ae>   DW_AT_alignment   : 1
    <8af>   DW_AT_decl_file   : 1
    <8b0>   DW_AT_decl_line   : 63
    <8b1>   DW_AT_type        : <0x98b>
 <5><8b5>: Abbrev Number: 0
 <4><8b6>: Abbrev Number: 0
 <3><8b7>: Abbrev Number: 9 (DW_TAG_subprogram)
    <8b8>   DW_AT_low_pc      : 0xd9e
    <8c0>   DW_AT_high_pc     : 0xd8
    <8c4>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <8c6>   DW_AT_name        : (indirect string, offset: 0x505): container_position
    <8ca>   DW_AT_decl_file   : 1
    <8cb>   DW_AT_decl_line   : 95
    <8cc>   DW_AT_type        : <0x98b>
    <8d0>   DW_AT_external    : 1
 <4><8d0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <8d1>   DW_AT_location    : 2 byte block: 91 2c 	(DW_OP_fbreg: 44)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x4b4): container_id
    <8d8>   DW_AT_decl_file   : 1
    <8d9>   DW_AT_decl_line   : 95
    <8da>   DW_AT_type        : <0x969>
 <4><8de>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <8df>   DW_AT_ranges      : 0x1e0
 <5><8e3>: Abbrev Number: 8 (DW_TAG_variable)
    <8e4>   DW_AT_location    : 2 byte block: 91 20 	(DW_OP_fbreg: 32)
    <8e7>   DW_AT_name        : (indirect string, offset: 0xae9b): i
    <8eb>   DW_AT_alignment   : 1
    <8ec>   DW_AT_decl_file   : 1
    <8ed>   DW_AT_decl_line   : 97
    <8ee>   DW_AT_type        : <0x98b>
 <5><8f2>: Abbrev Number: 0
 <4><8f3>: Abbrev Number: 0
 <3><8f4>: Abbrev Number: 9 (DW_TAG_subprogram)
    <8f5>   DW_AT_low_pc      : 0xe76
    <8fd>   DW_AT_high_pc     : 0x148
    <901>   DW_AT_frame_base  : 1 byte block: 52 	(DW_OP_reg2 (sp))
    <903>   DW_AT_name        : (indirect string, offset: 0x518): add_region
    <907>   DW_AT_decl_file   : 1
    <908>   DW_AT_decl_line   : 116
    <909>   DW_AT_type        : <0x969>
    <90d>   DW_AT_external    : 1
 <4><90d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <90e>   DW_AT_location    : 3 byte block: 91 c4 0 	(DW_OP_fbreg: 68)
    <912>   DW_AT_name        : (indirect string, offset: 0x4b4): container_id
    <916>   DW_AT_decl_file   : 1
